src/Documents/Тест_ПриходТоваров/Тест_ПриходТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Тест_ПриходТоваров</name>
  <registerRecords>AccumulationRegister.Тест_ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Тест_Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/Тест_ОстаткиТоваров/Тест_ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Тест_ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Тест_Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Тест_ПриходТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр Тест_ОстаткиТоваров
	Движения.Тест_ОстаткиТоваров.Записывать = Истина;
	Движения.Тест_ОстаткиТоваров.Очистить();
	Движение = Движения.Тест_ОстаткиТоваров.Добавить();
	Движение.Период = Дата;
	Движение.Товар = Товар;
	Движение.Количество = Количество;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#КонецЕсли
